docs/architecture/c4/mermaid/structurizr-Container.mmd
graph TB
  linkStyle default fill:#ffffff

  subgraph diagram ["Container View: Task Management"]
    style diagram fill:#ffffff,stroke:#ffffff

    1["<div style='font-weight: bold'>User</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>End User</div>"]
    style 1 fill:#ffffff,stroke:#4c8a1e,color:#4c8a1e
    2["<div style='font-weight: bold'>Administrator</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>Administrator</div>"]
    style 2 fill:#ffffff,stroke:#4c8a1e,color:#4c8a1e
    93("<div style='font-weight: bold'>Brevo</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>SMTP</div>")
    style 93 fill:#ffffff,stroke:#bf1e2e,color:#bf1e2e
    94("<div style='font-weight: bold'>Cloudinary</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Media Management SaaS</div>")
    style 94 fill:#ffffff,stroke:#f29100,color:#f29100

    subgraph 3 ["Task Management"]
      style 3 fill:#ffffff,stroke:#005696,color:#005696

      16("<div style='font-weight: bold'>Task Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Boot]</div><div style='font-size: 80%; margin-top:10px'>Task Service</div>")
      style 16 fill:#ffffff,stroke:#005696,color:#005696
      30("<div style='font-weight: bold'>Authentication Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Boot]</div><div style='font-size: 80%; margin-top:10px'>Authentication Service</div>")
      style 30 fill:#ffffff,stroke:#005696,color:#005696
      4["<div style='font-weight: bold'>UI</div><div style='font-size: 70%; margin-top: 0px'>[Container: React]</div><div style='font-size: 80%; margin-top:10px'>Single Page Application</div>"]
      style 4 fill:#ffffff,stroke:#005696,color:#005696
      42("<div style='font-weight: bold'>Comment Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Boot]</div><div style='font-size: 80%; margin-top:10px'>Comment Service</div>")
      style 42 fill:#ffffff,stroke:#005696,color:#005696
      5("<div style='font-weight: bold'>API Gateway</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Cloud Gateway]</div><div style='font-size: 80%; margin-top:10px'>API Gateway</div>")
      style 5 fill:#ffffff,stroke:#005696,color:#005696
      52["<div style='font-weight: bold'>Notification Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Boot]</div><div style='font-size: 80%; margin-top:10px'>Notification Service</div>"]
      style 52 fill:#ffffff,stroke:#005696,color:#005696
      58["<div style='font-weight: bold'>Message Broker</div><div style='font-size: 70%; margin-top: 0px'>[Container: RabbitMQ]</div><div style='font-size: 80%; margin-top:10px'>Message Broker</div>"]
      style 58 fill:#ffffff,stroke:#005696,color:#005696
      59[("<div style='font-weight: bold'>Profile DB</div><div style='font-size: 70%; margin-top: 0px'>[Container: Neo4j]</div><div style='font-size: 80%; margin-top:10px'>Graph DBMS</div>")]
      style 59 fill:#ffffff,stroke:#005696,color:#005696
      6("<div style='font-weight: bold'>Profile Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Boot]</div><div style='font-size: 80%; margin-top:10px'>Profile Service</div>")
      style 6 fill:#ffffff,stroke:#005696,color:#005696
      60[("<div style='font-weight: bold'>Task DB</div><div style='font-size: 70%; margin-top: 0px'>[Container: PostgreSQL]</div><div style='font-size: 80%; margin-top:10px'>RDBMS</div>")]
      style 60 fill:#ffffff,stroke:#005696,color:#005696
      61[("<div style='font-weight: bold'>Authentication DB</div><div style='font-size: 70%; margin-top: 0px'>[Container: PostgreSQL]</div><div style='font-size: 80%; margin-top:10px'>RDBMS</div>")]
      style 61 fill:#ffffff,stroke:#005696,color:#005696
      62[("<div style='font-weight: bold'>Comment DB</div><div style='font-size: 70%; margin-top: 0px'>[Container: MongoDB]</div><div style='font-size: 80%; margin-top:10px'>Document Store</div>")]
      style 62 fill:#ffffff,stroke:#005696,color:#005696
    end

    52-. "<div>Reads from and writes to</div><div style='font-size: 70%'>[HTTPS/REST]</div>" .->93
    4-. "<div>Makes API requests to</div><div style='font-size: 70%'>[JSON/HTTP]</div>" .->5
    5-. "<div>Forward</div><div style='font-size: 70%'></div>" .->6
    5-. "<div>Forward</div><div style='font-size: 70%'></div>" .->16
    5-. "<div>Forward</div><div style='font-size: 70%'></div>" .->30
    5-. "<div>Forward</div><div style='font-size: 70%'></div>" .->42
    6-. "<div>Subscribe event</div><div style='font-size: 70%'></div>" .->58
    6-. "<div>Reads from and writes to</div><div style='font-size: 70%'>[Bolt]</div>" .->59
    16-. "<div>Subscribe/Publish event</div><div style='font-size: 70%'></div>" .->58
    16-. "<div>Reads from and writes to</div><div style='font-size: 70%'>[JDBC]</div>" .->60
    16-. "<div>Fetch user info</div><div style='font-size: 70%'>[OpenFeign/HTTP]</div>" .->30
    16-. "<div>Fetch profile info</div><div style='font-size: 70%'>[OpenFeign/HTTP]</div>" .->6
    30-. "<div>Publish event</div><div style='font-size: 70%'></div>" .->58
    30-. "<div>Reads from and writes to</div><div style='font-size: 70%'>[JDBC]</div>" .->61
    42-. "<div>Subscribe event</div><div style='font-size: 70%'></div>" .->58
    42-. "<div>Reads from and writes to</div><div style='font-size: 70%'>[MongoDB Wire Protocol]</div>" .->62
    52-. "<div>Subscribe event</div><div style='font-size: 70%'></div>" .->58
    1-. "<div>Add project, task, comment,<br />...</div><div style='font-size: 70%'></div>" .->4
    2-. "<div>Manage user, workspace,<br />project, task, comment, ...</div><div style='font-size: 70%'></div>" .->4
    6-. "<div>Reads from and writes to</div><div style='font-size: 70%'>[HTTPS/REST]</div>" .->94

  end
